package com.janad.covid_19;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;
import androidx.recyclerview.widget.DividerItemDecoration;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.content.res.Resources;
import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

import com.janad.covid_19.Adapters.questionsAdapter;
import com.janad.covid_19.Adapters.videoPasAdapter;
import com.janad.covid_19.Models.mdlQuestions;
import com.janad.covid_19.Models.mdlVideo;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class QuestionsAnswers extends AppCompatActivity implements questionsAdapter.onQuestionsClickListener {


    questionsAdapter mQuestionsAdapter;
    RecyclerView recyclerView;
    private ArrayList<mdlQuestions> list = new ArrayList<>();

//    List<String> tags =


//            getResources().getStringArray(R.array.dashboard_tags));
     String[] txtQuesItems;
//        getResources().getStringArray(R.array.txt_Question_dari);

//            "خطر بیمار شدن فرزند من به ویروس کرونا چیست؟",
//            "چگونه می توانم برای شیوع در ناحیه و منطقه خود آماده شوم؟",
//            "چگونه می توانم برای  ویروس کرونا در محل کار آماده شوم؟",
//            "آیا باید ضد عفونی کننده دست خود را در خانه تهیه کنم اگر نتوانم آن را در فروشگاه پیدا کنم؟",
//            //"نوشیدن ایتانول (ایتایل الکول) کرونا یا کوید- ۱۹ را معالجه می کند؟",
//            //"کوید- ۱۹ میتواند با ادویجات که از کشور های غر ر ی نباشد تداوی شود؟",
//            //" معافیت، عوامل و تداوی همراه با مرجع مذهرب؟",
//            //"مراسم جنازه و خاکسپاری افرادیکه به اثر کوید- ۱۹ وفات میکنند صورت نمیگ رید؟"



    String[] txtAnsItems ;


//                        "•\tبر اساس شواهد موجود، به نظر نمی رسد کودکان بیشتر از بزرگسالان در معرض خطر ابتلا به ویروس کرونا باشند. در حالی که برخی از کودکان و نوزادان به بیماری  ویروس کرونا مبتلا بوده اند، بزرگسالان بیشترین موارد شناخته شده تاکنون را تشکیل می دهند. با این حال، چند کودک مبتلا به سندرم التهابی چند سیستمه (MIS-C) شده اند. در حال حاضر، اطلاعات در مورد این سندرم محدود است. مرکز کنترول و پیشگیری از امراض در حال کار با بخشهای بهداشت ایالتی و محلی برای کسب اطلاعات بیشتر در مورد MIS-C  است.",
//
//                        "برای کمک به محافظت از سلامتی خود و سلامتی افرادی که برایتان مهم است در صورت شیوع ویروس کرونا در جامعه، یک برنامه عملیاتی خانگی ایجاد کنید:\n" +
//                                "•\tبا افرادی که باید در برنامه شما گنجانده شوند صحبت کنید و درمورد اینکه در صورت بروز شیوع ویروس کرونا در جامعه شما چه باید بکنید، صحبت کنید.\n" +
//                                "•\tبرنامه هایی برای مراقبت از کسانی که ممکن است بیشتر در معرض خطر جدی قرار بگیرند، برنامه ریزی کنید.\n" +
//                                "•\tدر صورت مدت طولانی در خانه میمانید، اطمینان حاصل کنید كه آنها به 2 هفته دارو و مواد غذایی دسترسی دارند.\n" +
//                                "•\tهمسایگان خود را بشناسید و دریابید که آیا محله شما دارای یک وب سایت یا صفحه رسانه های اجتماعی است تا در ارتباط باشید.\n" +
//                                "•\tدر صورت نیاز به دسترسی به اطلاعات، خدمات مراقبت های بهداشتی، پشتیبانی و منابع، لیستی از سازمان های محلی ایجاد کنید که شما و خانواده تان می توانید با آنها تماس بگیرید.\n" +
//                                "•\tیک لیست تماس اضطراری از خانواده، دوستان، همسایگان، اشخاص دارای موتر، ارائه دهندگان خدمات بهداشتی، استادان، کارفرمایان، بخش بهداشت عمومی محلی و سایر منابع جامعه ایجاد کنید.\n",
//
//
//                        "برای تغییرات بالقوه در محل کار خود برنامه ریزی کنید. با کارفرمای خود در مورد برنامه عملیات اضطراری خود، از جمله سیاست های مرخصی استعلاجی و گزینه های کار نمودن از خانه، صحبت کنید. بیاموزید که چگونه مشاغل و کارفرمایان می توانند برای ویروس کرونا برنامه ریزی کنند و به آن پاسخ دهند.",
//
//                        "15. آیا باید ضد عفونی کننده دست خود را در خانه تهیه کنم اگر نتوانم آن را در فروشگاه پیدا کنم؟\n" +
//                                "مرکز کنترول و پیشگیری از امراض تولید و استفاده از محصولات ضد عفونی کننده دست خانگی را تشویق نمی کند زیرا نگرانی در مورد استفاده صحیح از آیکون خارجی ماده و نیاز به کار در شرایط استریل برای تولید محصول است. صنایع محلی که برای جبران کمبودهای تجاری به دنبال تولید ضد عفونی کننده دست هستند می توانند به راهنمایی سازمان بهداشت جهانی مراجعه کنند. نماد خارجی pdf icon سازمانها باید مجدداً به استفاده از کالای مورد تأیید FDA اداره غذا و دارو برای بازاریابی مجدد دست یابند، زیرا مجدداً این لوازم در دسترس شما قرار می گیرد.\n" +
//                                "•\tبرای اینکه در از بین بردن برخی از انواع میکروب ها موثر باشد، ضد عفونی کننده های دست باید حداقل 60٪ الکل داشته باشند و در صورت آلودگی و چرب بودن دست ها از آنها استفاده شود.\n" +
//                                "•\tبه دستورالعملهای \"خودتان انجام دهید\" یا \"DIY\" که فقط بر اساس روغنهای اساسی ساخته شده و یا بدون استفاده از روشهای صحیح ترکیب درست شده اند، اعتماد نکنید.\n" +
//                                "•\tاز ضد عفونی کننده دست برای ضد عفونی سطوح و اشیاء که مرتباً لمس می شوند استفاده نکنید. برای تمیز کردن و تمیز کردن خانه خود به اطلاعات مرکز کنترول و پیشگیری از امراض مراجعه کنید.\n"

                        //"نوشیدن الکول یا ایتانول نمی تواند ویروس کرونا معالجه و یا از ب ن ی ب رید. الکول خالص )ایتانول( و سایر محصولت مانن د، موا د سفید کننده و مواد ضد عفو ن ی کننده باید برای پاک نمودن و ض د عفو ن ی سازی سطوح مورد استفاده قرار گ ی د نه برای نوشیدن یا خوردن. اگر این مواد نوشیده شو د می تواند سبب مسمومیت شده و باعث برو ز امراض و ح ی ت مرگ گرد د. برای محافظت از خو د باید دستان تانرا مرتب ا بشکل درست بشوی د و از تماس با چشم، دهان و بی ن ت خودداری کنید. شس ی ن ی دست ها با صابون، پوشاندن دهان و بی ن ت با ماس ک و رعایت نمودن فاصله فزی کی حد اقل ی ک و نیم م ییی از دیگران اقدامات درجه اول اند كه از جانب افراد مسلکی صحی برای محافظت از افرا د و جلوگ یی از انتشار و سرایت ویروس به د یگران توصیه می ش وند. برای معلومات بیشیی در مورد تداوی ویروس به شماره تماس ۱۶۶ مرکز معلومات وزارت صحت عامه یا به شماره های ولی ی ت وزارت صحت عامه تماس بگ یید .",

                        //"به اساس معلومات سازمان صحی جهان، تا به امروز هیچ واکس ن ی و هیچ ادویه خاصی طرت و گیاهی یا یونا ن ی برای وقایه یا تداوی ویروس جدید کرونا )کوید- ۱۹ ( وجود ندارد. ث یات آن حاصلٔ افراد مبتلا با ویروس باید مراقبت مناسب را جهت تداوی اعراض و کاهش تا نمایند و افراد که اعراض شدید دارند باید مراقبت مطلوب طرت را حاصل نمایند. افراد مبتلا به اعراض شدید ممکن است در شفاخانه های مجهز با وسایل کمک تنفسی تحت مراقبت قرار بگ یند، اما اک ری افراد بدون این نوع تداوی از اعراض مرض شفایاب می شوند. برای معلومات بیشیی در مورد تداوی ویروس به شماره تماس ۱۶۶ مرکز معلومات وزارت صحت عامه یا در صورت نیاز به شماره های ولی ی ت وزارت صحت عامه تماس بگ یید.",
                        //" برعلاوه توصیه های سازمان صحی جهان و وزارت صحت عامه، این رهنمود های اسلامی ن ر ی ی میتوان د د ر پاسخ اعتقا د کمک کن د که گویا مسلمانان در برابر کرونا معافیت دارن د: در طول ادوار تاری ن حی از زمان یاران پیغم ری )ص( امراض گسییده همه گ ی ثر ساخته ان دٔ  مسلمانان را متا . اگر مسلمانان در مقابل امراض همه گ ی ثر نمیشدند هرگز هدایات عملی الهی در مورد محافظت از خودٔ معافیت میداشتند و یا از این مرض متا در مقابل امراض همه گ ی نازل نمی شً د. این هدایات در قانون اسلامی کاملا به ضاحت بیان شد ه. به هم ن ی منظور چندین حدیث صحیح ن ن ی به امراض همه گ ی اشاره میکند و هدایت میدهد که چگونه جوامع را از ر سر آن محافظت نمائیم. بطور مثال، هدایت دادن به اینکه در جاهایکه عفونت وجود دارد باید رفته نشو د. )مرجع: صحیح البخاری — ۵۷۲۸ ، صحیح مسل م — ۲۲۱۸ ) \n" +
                          //      "إذا سمعتم بالطاعون بأرض فلا تدخلوها , وإذا وقع بأرض وأنتم بها فلا تخرجوا منها) صحیح البخاری — ۵۷۲۸ .)\n" +
                            //    "ترجمه: هرگاه شنیدید که طاعون در محلی بوجود آمده آنجا نروید و اگر در جا یی موجود هست و شما آنجا هستید؛ آنجا را ترک نکنی د.",

                        //"در صورت دست زدن به بدن فردی که بعد از مصاب شدن به کووید - ۱۹ فوت نموده باشد باید از اقدامات احتیاطی ویژه استفاده شود تا از سرایت بیشیی ویروس به دیگران جلوگ یی شود .با وجود آن هم با آنها باید در مطابقت با روایات اسلامی مانند سایر افرادی که ازعلل دیگری می م یند برخورد صورت گيرد .\n" +
                          //      "افراد ممکن از سبب کووید- ۱۹ در مراکز مراقبت های صحی، خانه یا سایر جا ه ا بم یند و مصئونیت و صحتمندی همه کسا نی که از میت و مذهرت و خانواده وی باید اح ییامی مواظبت می نمایند باید اول ن ی اولویت باشد. به وقار و حیثیت میت، رسوم فرهنکی قایل شده و از آن محافظت شود. اما از تجمع زیاد مردم باید در مراسم جنازه و به خاک سپاری خودداری گرد د و یا هم به روش مصئون انجام شود که همه دهان و بی ن ت خود را با ماسک پوشانده و فاصله یک و نیم م ییی را از یک دیگر مراعات کنند تا ا ز سرایت ویروس در ب ن ی مردم که از موجودیت\n" +
                            //    "ویروس در بدن شان ری خر ی هستند جلوگ یی بعمل آید. از دفع عجولنه جس د میت که به سبب کووی د- ۱۹ فوت نموده باشد بای د تحت هر گونه ر سرایط اجتناب صورت گ ید.",




//    };


    String[] txtQuesItemsPeshto;
//            "له  COVID-19 سره زما د ماشوم د ناروغېدو خطر څه دی؟",
//            "زه څنګه کولی شم په سیمه کې د وبا لپاره چمتووالی ونیسم؟",
//            "زه څنګه کولی شم په کار کې د COVID-19 لپاره چمتو شم؟",
//            "آیا زه کولای شم  د ضد عفوني مایع په خپله جوړ کړم که چېرې په پلورونځي کې پیدا نه کړم. ؟",
            //"نوشیدن ایتانول (ایتایل الکول) کرونا یا کوید- ۱۹ را معالجه می کند؟",
            //"کوید- ۱۹ میتواند با ادویجات که از کشور های غر ر ی نباشد تداوی شود؟",
            //" معافیت، عوامل و تداوی همراه با مرجع مذهرب؟",
            //"مراسم جنازه و خاکسپاری افرادیکه به اثر کوید- ۱۹ وفات میکنند صورت نمیگ رید؟"

//    };

    String[] txtAnsItemsPeshto;

//           "د شواهدو پر اساس ماشومان داسې نه بریښي چې د لویانو په پرتله، COVID-19 ورته لوړ خطر وي، پداسې حال کې چې ځینې کوچنیان او نوي ماشومان د COVID-19 لامله ناروغان شوي، لویان تر نن ورځې ډیری پیژندل شوې قضیې جوړوي. په هرصورت، یو څو ماشومانو د ملټي سیسټم انفلاټري سنډروم (MIS-C) رامینځته کړی. اوس مهال، د دې سنډروم په اړه معلومات محدود دي، CDC د ریاست او محلي روغتیا څانګو سره کار کوي ترڅو د MIS-C په اړه نور معلومات ترلاسه کړي.",
//
//            "کورنی پلان رامنځته کړئ ترڅو ستاسو په ټولنه کې د COVID-19 ناروغۍ پیښې په صورت کې ستاسو او ستاسو د سیمې د خلکو مرسته وکړي.\n" +
//                    "ـ د هغه خلکو سره خبرې وکړئ څوک چې اړتیا لري ستاسو په پلان کې شامل شي او په دې اړه بحث وکړئ که چیرې ستاسو په ټولنه کې د COVID-19 ناروغي رامنځته شي نو د مخنیوي لپاره یې څه پکار دي.\n" +
//                    "ـ د هغو کسانو پاملرنې لپاره لارې چارې پلان کړئ څوک چې ممکن د جدي پیچلتیاوو لپاره خورا ډیر خطر ولري.\n" +
//                    "ـ ډاډ ترلاسه کړئ چې دوی د 2 اونیو درملو او توکو ته لاسرسی لري که چیرې تاسو اړتیا لرئ د اوږدې مودې لپاره کور کې پاتې شئ.\n" +
//                    "ـ خپلو ګاونډیو سره وپیژنئ او معلومه کړئ چې آیا ستاسو ګاونډی ویب سایت یا د ټولنیزو رسنیو ته لاسرسی لري  ترڅو اړیکې وساتي.\n" +
//                    "ـ د ځايي سازمانونو لېست رامنځته کړئ چې تاسو او ستاسو کورنۍ د ناروغي په وخت کې تاسو ورته اړتیا لرئ.\n" +
//                    "ـ د کورنۍ، ملګرو، ګاونډیو، موټر چلوونکو، روغتیا پاملرنې چمتو کونکي، ښوونکي، کار ګمارونکي، د عامې روغتیا محلي اداره او د ټولنې نورو سرچینو بېړني تماس لیست چمتو کړئ\n",
//
//            "په خپل کاري ځای کې د احتمالي بدلونونو لپاره پلان جوړ کړئ، خپل د کار ګمارونکي سره د دوی د اضطراري عملیاتو پلان په اړه وغږیږئ او زده کړئ چې څنګه سوداګرۍ او کار ګمارونکي کولی شي د COVID-19 لپاره پلان او ځواب ورکړي.",
//
//            "CDC  د کور د لاسي صنایعو تولیداتو تولید  سم نه بولی ځکه د سرطان خطر په کې ډېر وی  کیمیاوي چې  ترکیبونو کارولوپه سنتي توګه  په اړه اندیښنې شتون لري  اویاد ترکیب جوړولو لپاره د بې طرفه  ادارې ترلاس لاندې جوړیدای سي. سیمه ییز صنعتونه چې د  یادو مواد جوړولو لپاره  چې په لږ اندازه پیداکیږي د روغتیا نړیوال سازمان په لار ښونه کولای شي دا تشه ډکه کړئ او یاده ضد عفوني مایع جوړه کړي.\n" +
//                    "•\tد میکروبونو وژلو لپاره، د ضد عفوني مایع باید د60 ٪  سلنه الکول  ولري اوپه هغه صورت کې  وکارول شي چې کله لاسونه د لیدلو وړ  او یا چرب  نه وي.\n" +
//                    "•\t\"یوازې دا پخپله وکړئ\" یا \"DIY\" ترکیبونو باندې تکیه مه کوئ یوازې د اړتیا وړ غوړو پراساس یا د ترکیب له ټول مرکب کولو پرته ترتیب شوي.\n" +
//                    "•\tد  ضد عفوني مایع په مکرر ډول مه کاروئ  چې سطحې او توکي عفوني کړئ. د خپل کور   او پاکولو لپاره د CDC معلومات وګورئ.\n"
//
//
//
//    };

    String[] txtCoronaQuesItems;
//            "ویروس کرونا چیست؟",
//            "چرا این بیماری بیماری ویروس کرونا 2019، COVID-19  نامیده می شود؟",
//            "ویروس چگونه گسترش می یابد؟",
//            "آیا ویروس کرونا از طریق غذا (از جمله غذای خارج شده از رستوران، تولید شده، یخ زده یا بسته بندی) یا آب آشامیدنی قابل سرایت است؟",
//            "آیا هوای گرم شیوع ویروس کرونا را متوقف می کند؟",
//            "گسترش در بین جامعه چیست؟",
//            "آیا پشه ها یا کنه ها می توانند ویروسی را که باعث ویروس کرونا می شود، گسترش دهند؟"
//
//    };

    String[] txtCoronaAnsItems;
//            "•\tویروس کرونا ویروس جدیدی است که قبلاً شناسایی نشده بود. ویروس عامل بیماری ویروس کرونا 2019 (COVID-19) ، منجمله ویروس هایی نیست که معمولاً در بین انسان ها انتشار پیدا می کنند و باعث بیماری خفیف می شوند، مانند سرماخوردگی.",
//
//            "•\tبه تاریخ 11 ماه فبروری سال 2020، سازمان بهداشت جهانی نام رسمی بیماری را که اولین بار باعث شیوع ویروس کرونا در سال 2019 در ووهان چین شده بود را اعلام کرد. نام جدید این بیماری ویروس کرونا 2019 است که به اختصار COVID-19 نامیده می شود. در  COVID-19،\"CO\"  مخفف\"corona\" ، \"VI\" برای \"ویروس\" و \"D\" برای بیماری است. در گذشته، این بیماری به عنوان \"ویروس جدید کرونا 2019 یا \"nCoV-2019\" شناخته می شد.\n" +
//                    "•\tویروس های کرونا در انسان انواع مختلفی دارند از جمله برخی از آنها معمولاً باعث بیماری های خفیف دستگاه تنفسی فوقانی می شوند. کووید-19 یک بیماری جدید است که توسط ویروس جدید کرونا ایجاد شده که قبلاً در انسان دیده نشده بود.\n",
//
//            "•\tتصور می شود ویروسی که باعث کووید-19 می شود، عمدتاً از فردی به فرد دیگر از طریق قطره های تنفسی که هنگام آلودگی از فرد توسط سرفه، عطسه یا مکالمه ایجاد می شود، انتقال یابد. این قطرات می توانند در دهان یا بینی افرادی که در نزدیکی آنها احتمالاً توسط ریه ها قطرات را استنشاق (بازدم) می کنند، قرار گیرند. گسترش بیشتر هنگامی صورت میگیرد که افراد در تماس نزدیک با یکدیگر هستند (در حدود ۲ متر) بیشتر است.\n" +
//                    "•\tبه نظر می رسد کووید-۱۹ در بسیاری از مناطق جغرافیایی آسیب دیده به راحتی و با پایداری در جامعه در حال گسترش است (\"گسترش جامعه\"). گسترش جامعه به این معنی است که افراد در منطقه ای به ویروس آلوده شده اند، از جمله برخی از آنها مطمئن نیستند که چگونه یا از کجا آلوده شده اند.\n",
//
//            "•\tدر حال حاضر هیچ مدرکی مبنی بر ابتلا به ویروس کرونا از طریق خوردن غذا یا دست زدن به غذا وجود ندارد.\n" +
//                    "•\tممکن است افراد با لمس یک سطح یا شی، مانند بسته بندی مواد غذایی یا ظروف غذاخوری که ویروس روی آن قرار دارد و سپس لمس دهان، بینی یا احتمالاً چشم خود، به ویروس کرونا مبتلا شوند. با این حال، تصور نمی شود که این اصلی ترین راه انتشار ویروس باشد.\n" +
//                    "•\tهمچنان هیچ مدرکی در حال حاضر وجود ندارد که افراد با نوشیدن آب به ویروس کرونا مبتلا گردند. ویروس کووید-19 در آب آشامیدنی شناسایی نشده است. روش های متداول تصفیه آب که از فیلتراسیون و ضد عفونی استفاده می کنند، مانند روش هایی که در بیشتر سیستم های آب آشامیدنی شهری وجود دارد، ویروس عامل کویید-19 را از بین میبرد. \n",
//
//           "•\tهنوز مشخص نیست که آیا هوا و دما بر گسترش ویروس کرونا تأثیر دارند یا خیر. برخی ویروسهای دیگر، مانند ویروسهایی که باعث سرماخوردگی و آنفولانزا می شوند، در ماه هایی که هوا سرد است، بیشتر گسترش می یابند اما این بدان معنا نیست که در طی ماههای دیگر انتقال ویروس غیرممکن باشد. در مورد انتقال، شدت و سایر ویژگی های مرتبط با ویروس کرونا چیزهای بیشتری برای یادگیری وجود دارد و تحقیقات در حال انجام است.",
//
//
//            "•\tگسترش جامعه به این معنی است که افراد در منطقه ای به ویروس آلوده شده اند، از جمله برخی از آنها مطمئن نیستند که چگونه یا از کجا آلوده شده اند. هر بخش بهداشتی بر اساس شرایط محلی، گسترش جامعه را متفاوت تعیین می کند. برای اطلاعات در مورد گسترش جامعه در منطقه خود، لطفاً به وب سایت بخش صحت خود مراجعه کنید.",
//
//            "•\tدر حال حاضر، اداره کنترول و جلوگیری از امراض هیچ اطلاعاتی برای اثبات انتشار ویروس کرونا یا سایر ویروس های مشابه از طریق با پشه ها یا کنه ها را ندارد. راه اصلی انتشار ویروس کرونا از فردی به فرد دیگر از طریق تماس مستقیم است. برای اطلاعات بیشتر به نحوه انتشار ویروس کرونا به وبسایت وزارت صحت مراجعه کنید."
//    };

    // Peshto

    String[] txtCoronaQuesItemsPeshto;
//            "ناول کرونا ویروس څه دی؟",
//            "ولې دا ناروغي د کرونا ویروس  2019، COVID-19 په نوم یادیږي؟ ",
//            "ویروس څنګه خپریږي؟",
//            "آیا  له خوړو څخه د کویډ نولس لېږد کیدای شي. (له رستورانت څخه خواړه اخیستل، بسته شوي خواړه، څښاک، تولید) یا د څښاک اوبه؟",
//            "آیا ګرمه هوا د COVID-19 پراخېدو مخه  نیسي؟",
//            "په ټولنه کې څنګه خپریږي؟",
//            "آیا میاشې یا ټیکونه، ویروس خپروي چې د COVID-19 لامل کیږي؟"

//    };

    String[] txtCoronaAnsItemsPeshto;
//            " ناول کرونا ویروس یو نوی کرونا ویروس  دی، چې مخکې نه و  پیژندل شوی،  یاد ویروس چې د کرونا ویروس د ناروغي لامل کیږي 2019 ، COVID-19د کرونا ویرس په څېر نه دی، چې له یو انسان څخه بل  انسانانو ته د لېږد لامل شي بلکې د عادي ناروغۍ په څېر د  ناروغۍ لامل کیږي.",
//
//            "د روغتیا نړیوال سازمان  د دې ناروغۍ لپاره چې لومړی ځل د چین اوهان کې پېژندل شوی وه د فبروري په 11، 2020 کې رسمي نوم اعلان کړ  ،  د دې ناروغۍ نوی نوم د  کوېډ نولس 2019 ده چې د COVID-19 په نوم لنډیز شوی. په COVID-19 کې، 'CO' د 'کرونا'، 'VI'  د  'ویروس'،لپاره او 'D'  د ناروغۍ. لپاره دلالت کوي، مخکې، دې ناروغۍ ته د 2019 ناول کرونا ویروس یا COVID-19,2019  په توګه اشاره شوې.\n" +
//                    " انساني کرونا ډېر ډولونه لري چې ځينې یې د تنفسي   د ناورغۍ لامل کیږي.    COVID-19  یوه نوې ناروغي ده، چې د ناول (یا نوي) کرونا ویروس له امله رامنځته شوې چې  مخکې په انسانانو کې  نه وه لیدل شوې.\n",
//
//            "دا ویروس چې د COVID-19 لامل کیږي په  عامه توګه له یو کس څخه بل کس ته خپریږي، په ځانګړي توګه د تنفسي څاڅکو له لارې رامنځته کیږي، کله چې یو ناروغ   ټوخی یا خبرې کوي، دا څاڅکي د مقابل لوري ته د خولې او پوزې له لارې ننوځي او سږو ته انتقالیږي. یاد ویروس د خلکو ترمنځ د شپږ فوټونو په واټن کولای شي  د لېږد لامل شي.      \n" +
//                    " داسې بریښي چې کوېډ نولس په ټولنه او اغېزمنو سیمو کې په اسانه او دوامداره ډول خپریږي، په دې معنا د ټولنې ډېری وګړي په دې نه پوهیږي چې چېرته او څنګه په دې ناروغۍ اخته شوي.     \n",
//
//            "•\tتر اوسه ثابته شوې نه ده چې ګواکې کوېډ نولس دې د خوړو او خوړلو له لارې د لېږد لامل شي.\n" +
//                    "•\tممکن هغه خواړه چې  یو ډول پوښ ولري د خولې ،پزې او سترګو له لارې د لېږد لامل شي، مګر تر اوسه نه ده ثابته شوې چې د ویروس خپرېدو اصلي لاره وي.\n" +
//                    "•\tاوس هم په ډاګه شوې نه ده چې د اوبو څښلو سره COVID-19  انتقال شي د  COVID-19  ویروس د څښاک اوبو کې نه دی موندل شوی، د اوبو  د تصفیې  دودیز میتودونه چې د فلټریشن او غیرمنتن کاروي، لکه د ښاروالۍ د څښاک    اوبو سیسټمونو کې، باید ځينې   ویروسونه  له مینځه وې سي یا ووژني چې د COVID-19  لامل کیږي.\n",
//
//            "دا لا نه ده معلومه چې آیا هوا او تودوخی د COVID-19 په خپریدو اغیزه کوي، ځینې نور ویروسونه، لکه هغه ډول چې د والګي لامل کیږي او  په سړو  میاشتو کې ډېر خپریږي، مګر پدې معنی نه ده چې د نورو میاشتو په اوږدو کې د دې ویروسونو سره ناروغ کېدل ناممکن وي د لېږد وړتیا، شدت، او نورو خاصیت په اړه چې د COVID-19 سره تړاو لري زده کولو لپاره نور ډیر څه شتون لري او تحقیقات روان دي.",
//
//            "په ټولنه کې خپرېدل په دې معنا چې په یوه سیمه کې خلک په دې  ویروس اخته شوي وي خو په دې نه پوهیږي چې څنګه او چېرته په دې ناروغۍ اخته شوي دي؛ د روغتیا هر ریاست د ځايي شرایطو پر اساس  د  ویروس مخنيوي لپاره   یاد ویروس په مختلفو بڼه  کنټرولوي،  په سیمه کې مو د ویروس د خپراوي  د معلوماتو لپاره د خپل روغتیا ریاست ویب پانه وګورئ.   ",
//
//            "په دې وخت کې، CDC هیڅ معلومات نه لري ترڅو معلومه کړي چې دا نوی کرونا ویروس یا ورته کرونا ویروسونه د مچیو یا ټیکونو لخوا خپریږي، اصلي لاره چې COVID-19 خپروي د یو شخص څخه بل انسان ته ده، د نورو معلوماتو لپاره (کرونا ویروس څنګه خپریږي) وګورئ."
//    };

    String[] txtSympQuesItems={

    };

    String[] txtSympAnsItems={

    };


    String[] txtPrevQuesItems;
//            "آیا مرکز کنترول و پیشگیری از امراض استفاده از ماسک را برای جلوگیری از ویروس کرونا توصیه می کند؟",
//            "اگر بیمار شدم یا شخصی در خانه ام بیمار شد چه کاری باید انجام دهم؟",
//            "اگر از نزدیک با کسی که مبتلا به ویروس کرونا است تماس داشته باشم چه کاری باید انجام دهم؟",
//            "چگونه می توانم کودک خود را در برابر عفونت ویروس کرونا محافظت کنم؟"
//
//    };

    String[] txtPrevAnsItems;

//            "•\tدر محیط های عمومی هنگام حضور در محل زندگی افرادی که در خانه شما نیستند و به ویژه در مواردی که نگهداری سایر اقدامات فاصله اجتماعی دشوار است، مانند فروشگاه های مواد غذایی، داروخانه ها و پمپ استیشن ها از ماسک استفاده کنید. ماسک ها ممکن است سرعت انتشار ویروس را کاهش دهند و به افرادی که ممکن است ویروس داشته باشند و از انتقال آن به دیگران اطلاع ندارند، کمک کنند.\n" +
//                    "•\t ویروس کرونا توسط افرادی که علائمی ندارند و نمی دانند آلوده هستند، قابل انتقال است. به همین دلیل است که برای همه افراد مهم است که فاصله اجتماعی (حداقل 2متر فاصله با افراد دیگر) را حفظ کنند و در محیط های عمومی ماسک بزنند. ماسک ها یک لایه اضافی برای جلوگیری از انتشار قطرات تنفسی در هوا و افراد دیگر فراهم می کنند.\n" +
//                    "•\tماسک های توصیه شده ماسک های جراحی یا ماسک های تنفسی N-95 نیستند. این موارد مهم و حیاتی است که باید همچنان برای کارکنان مراقبت های بهداشتی و سایر پاسخ دهندگان پزشکی اختصاص یابد، همانطور که توسط راهنمای مرکز کنترول و پیشگیری از امراض توصیه شده است.\n",
//
//            "•\tبیشتر افرادی که ویروس کرونا دارند می توانند در خانه بهبود یابند. مرکز کنترول و پیشگیری از امراض برای افرادی که در خانه بهبود می یابند و مراقبان آنها راهنمایی های زیر را توصیه میکند:\n" +
//                    "•\tدر هنگام بیماری در خانه بمانید، به جز زمانیکه به مراقبت های پزشکی نیاز داشتید.\n" +
//                    "•\tبرای اعضای بیمار خانه (در صورت امکان) از اتاق و حمام جداگانه استفاده کنید.\n" +
//                    "•\tدستان خود را حداقل به مدت حداقل 20 ثانیه با آب و صابون بشویید، به خصوص پس از دمیدن بینی، سرفه یا عطسه، دستشویی رفتن و قبل از خوردن یا تهیه غذا.\n" +
//                    "•\tاگر آب و صابون به راحتی در دسترس نیست، از ضد عفونی کننده دست با الکل حداقل 60٪ استفاده کنید. همیشه دست ها را با آب و صابون بشویید اگر دست ها به وضوح کثیف هستند.\n" +
//                    "•\tبرای کمک به جلوگیری از شیوع ویروس کرونا به دیگران، ماسک های تمیز و یکبار مصرف صورت را برای استفاده در خانه در اختیار بیمار خانه خود قرار دهید.\n" +
//                    "•\tدر صورت لزوم اتاق بیمار و دستشویی را تمیز کنید تا از تماس غیرضروری با فرد بیمار جلوگیری شود.\n" +
//                    "•\tبا این حال، برخی از افراد ممکن است به مراقبت های پزشکی فوری نیاز داشته باشند. مراقب علایم باشید و بیاموزید چه موقع به دنبال فوریت های پزشکی باشید.\n" +
//                    "•\tچه زمانی باید به دنبال فوریت های پزشکی باشید؟\n" +
//                    "•\tبه دنبال علائم هشدار دهنده اضطراری* برای ویروس کرونا باشید. اگر کسی هر یک از این علایم را نشان می دهد، بلافاصله به مراقبت های طبی فوری مراجعه کنید.\n" +
//                    "•\tمشکل تنفس\n" +
//                    "•\tدرد یا فشار مداوم در قفسه سینه\n" +
//                    "•\tسردرگمی جدید\n" +
//                    "•\tعدم توانایی بیدار شدن یا بیدار ماندن\n" +
//                    "•\tلبها یا صورت مایل به آبی است\n" +
//                    "•\t*  این لیست همه علایم احتمالی نیست. لطفاً برای سایر علایم شدید یا نگران کننده با داکتر خود تماس بگیرید.\n" +
//                    "•\tبا شماره 166 تماس بگیرید یا با مرکز اضطراری محلی تماس بگیرید: به اپراتور اطلاع دهید که به دنبال مراقبت از شخصی هستید که مبتلا به ویروس کرونا است یا ممکن است به آن مبتلا باشد.\n",
//
//           "•\tبرای علائم هوشیار باشید. مراقب تب، سرفه، تنگی نفس یا سایر علایم ویروس کرونا باشید.\n" +
//                   "•\t در صورت بروز علایم، دما را کاهش داده و از راهنمایی های مرکز کنترول و پیشگیری از امراض پیروی کنید.\n",
//
//
//            "•\tشما می توانید با آموزش دادن كودكان به همان كارهایی كه همه برای سالم ماندن باید انجام دهند، كودك خود را ترغیب كنید تا مانع از شیوع ویروس کرونا شود.\n" +
//                    "•\tاز تماس نزدیک با افراد بیمار خودداری کنید.\n" +
//                    "•\tدر هنگام بیماری در خانه بمانید، به جز نیاز برای مراقبت های پزشکی.\n" +
//                    "•\tسرفه و عطسه خود را با دستمال بپوشانید و بافت را در سطل زباله بیندازید.\n" +
//                    "•\tدستان خود را حداقل به مدت 20 ثانیه با آب و صابون بشویید.\n" +
//                    "•\tاگر آب و صابون به راحتی در دسترس نیست، از ضد عفونی کننده دست با الکل حداقل 60٪ الکل استفاده کنید.\n" +
//                    "•\tسطوح و اشیای مکرر لمس شده را تمیز و ضد عفونی کنید، مانند میزها، میزهای پیشخوان، کلیدهای روشنایی، دستگیره های دروازه و دستگیره های کابینت و الماری.\n"
//    };

    String[] txtPrevQuesItemsPeshto;
//            "آیا CDC د COVID-19 مخنیوی لپاره د ماسکونو کارول وړاندیز کوي؟",
//            "که زه  یا زما کور کې کوم څوک ناروغ شي، نو زه باید څه وکړم ؟",
//            "زه باید څه وکړم که چېرې ما د هغه چا سره نږدې اړیکه درلوده څوک چې COVID-19 لري؟",
//            "زه څنګه کولی شم خپل ماشوم د COVID-19 انتاناتو څخه خوندي کړم؟"

//    };

    String[] txtPrevAnsItemsPeshto;

//            "په عامه ځایونو کې ماسک واغوندئ کله چې شاوخوا خلک ستاسو په کور کې نه اوسیږي او په ځانګړي توګه چیرې چې د نورو ټولنیزو واټنونو ساتل ستونزمن وي، لکه د کرایې پلورنځي، درملتونونه او ګاز سټیشنونه؛ ماسک ممکن د ویروس خپرېدل ورو کړي او له هغو خلکو سره مرسته وکړي چې ممکن ویروس ولري او نورو ته یې د لیږدولو څخه نه پوهیږي.\n" +
//                    "COVID-19 د هغه خلکو لخوا خپرېدی شي څوک چې نښې نه لري او نه پوهیږي چې دوی په ناروغۍ اخته شوي، له همدې امله د هر چا لپاره دا مهمه ده چې ټولنیزه فاصله مراعت کړي (د نورو خلکو څخه لږ تر لږه 6 فوټه لرې ودریږي) او په عامه ځایونو کې ماسک واغوندي، ماسک له موږ سره مرسته کوي ترڅو په هوا کې او نورو خلکو ته د تنفسي څاڅکو مخه ونیسي.\n" +
//                    "وړاندیز شوي ماسکونه د جراحي ماسک یا N-95 تنفس نه دي، دا خورا مهم توکي دي چې باید د صحي کارمندانو او نورو طبي لومړي ځواب ویونکو لپاره خوندي وساتل شي، لکه څنګه چې د اوسني CDC لارښود لخوا وړاندیز شوي.\n",
//
//            "ډېری خلک چې COVID-19 ویروس سره مخ کیږي نو د CDC  د لارښوونو له مخې لاندې ټکو ته دې پام وکړي:\n" +
//                    "ـ کله چې تاسو ناروغ شوئ نو کور کې پاتې شئ او روغتیايي لارښوونې مراعت کړئ.\n" +
//                    "ـ د ناروغ لپاره جلا خونه او تشناب معلوم کړئ.\n" +
//                    "ـ لږ تر لږه 20 ثانیو لپاره خپل لاسونه له صابون او اوبو سره ومینځئ، په ځانګړي توګه دا کار د پزې له بهېدلو، ټوخېدو، تشناب ته له تللو وروسته  او د خوړو چمتو کولو مخکې او وروسته وکړئ.\n" +
//                    "ـ که صابون او اوبه نه وي نو لاسونه مو په الکولو کړئ. \n" +
//                    "ـ د ناروغ کس لپاره د خوړو د برابرولو او نورو اړینو شیانو لپاره جلا کس وټاکئ.\n" +
//                    "ـ د ناروغ خونه او تشناب پاک کړئ، لکه څنګه چې اړتیا وي، د ناروغ کس سره غیر ضروري اړیکو څخه مخنیوی وکړئ.\n" +
//                    "ـ د بېړنیو حالاتو وخت کې د عامې روغتیا د توصیو مطابق عمل وکړئ.\n" +
//                    "د COVID-19 نښې یا علامې دا دي:\n" +
//                    "ـ تنفسي ستونزه\n" +
//                    "ـ په سینه کې دوامداره درد یا فشار\n" +
//                    "ـ ذهني مغشوشتیا\n" +
//                    "ـ د ویښېدو یا ویښ پاتې کېدو ناتوانتیا\n" +
//                    "ـ شونډو او مخ وچوالی\n" +
//                    "دا لیست ټول ممکنه نښې نه دي، مهرباني وکړئ خپل طبي وړاندیز کوونکي ته د نورو علاماتو لپاره زنګ ووهئ.\n",
//
//            "ـ د ویروس له نښو څخه ځان خبر کړئ، تبه، ټوخی، د ساه لنډۍ، یا د COVID-19 نښې نښانې دي.\n" +
//                    "ـ خپله تودوخه وګورئ او د CDC لارښود تعقیب کړئ که تاسو نښې ولرئ.\n",
//
//            "ـ تاسو کولی شئ خپل ماشوم وهڅوئ چې د COVID-19 خپریدو مخنیوي کې مرسته وکړي او هر کس مسوول دی چې دا پاملرنې مراعت کړي.\n" +
//                    "ـ د ناروغانو سره د نږدې تماس څخه ډډه وکړئ.\n" +
//                    "ـ کور کې پاتې شئ کله چې تاسو ناروغ یاست، پرته له دې چې د روغتیا پاملرنې ترلاسه کړئ.\n" +
//                    "ـ کله چې ټوخی کوئ نو خپلې خولې ته کاغذ ونیسئ او بیا دا کاغذ په کثافت دانۍ کې واچوئ.\n" +
//                    "ـ خپل لاسونه معمولا د 20 ثانیو لپاره په صابون او اوبو سره ومینځئ.\n" +
//                    "ـ که صابون او اوبه نه وي نو لاسونه مو په الکولو کړئ. \n" +
//                    "ـ خپل شخصي توکي لکه، میزونه، د دروازې قیدونه، سویچونه... پاک کړئ. \n"
//    };

    String selectedItems, SelectedLang;

    TextView txtHeading;

    //TextView txtTitleHeading;
    Toolbar toolbar;
    ImageView toolBackArrow;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_questions_answers);

        Resources res = getResources();
        //Dari and Peshto
        txtQuesItems = res.getStringArray(R.array.txt_Question);
        txtAnsItems = res.getStringArray(R.array.txt_answers_items);

        //Corona Questions
        txtCoronaQuesItems = res.getStringArray(R.array.txtCoronaQuesItems);
        txtCoronaAnsItems = res.getStringArray(R.array.txtCoronaAnsItems);


        txtPrevQuesItems = res.getStringArray(R.array.txtPrevQuestItems);
        txtPrevAnsItems = res.getStringArray(R.array.txtPrevAnsItems);

        //txtQuesItemsPeshto = res.getStringArray(R.array.txt_Question_peshto);
        //txtAnsItemsPeshto = res.getStringArray(R.array.txt_answers_items_peshto);



        // Widgets
        toolbar = findViewById(R.id.toolbar);
        toolBackArrow = toolbar.findViewById(R.id.toolBackArrow);

        toolBackArrow.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {

                Intent intent = new Intent(QuestionsAnswers.this, MainActivity.class);
                Bundle extras = new Bundle();
                extras.putString("Selected",SelectedLang);
                intent.putExtras(extras);
                startActivity(intent);
                finish();
            }
        });


        recyclerView = (RecyclerView) findViewById(R.id.rvQuestions);
        txtHeading = (TextView) findViewById(R.id.txtHeading);

        getIncomingIntent();




    }

    private void getIncomingIntent() {

        if( (getIntent().hasExtra("Selected"))  ){

            Intent intent = getIntent();
            Bundle b = intent.getExtras();

            selectedItems = b.getString("Selected");
            SelectedLang = b.getString("SelectedLang");

            /*if(selectedItems.equals("VideoPashto")){

                //txtTitleHeading.setText("");

                mVideoPasAdapter = new videoPasAdapter(getVideoLists(),this);
                recyclerView.setLayoutManager(new LinearLayoutManager(this));
                DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                recyclerView.addItemDecoration(DID);
                recyclerView.setAdapter(mVideoPasAdapter);
            }*/

            if(selectedItems.equals("Questions")){

                if(SelectedLang.equals("fa")) {

                    mQuestionsAdapter = new questionsAdapter(getQuestionsAndAnswersItems(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\tبا شماره 166 تماس بگیرید یا با مرکز اضطراری محلی تماس بگیرید: به اپراتور اطلاع دهید که به دنبال مراقبت از شخصی هستید که مبتلا به ویروس کرونا است یا ممکن است به آن مبتلا باشد.");

                }else if(SelectedLang.equals("ps")){


                    mQuestionsAdapter = new questionsAdapter(getQuestionsAndAnswersItemsPeshto(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\t6 166 ته زنګ ووهئ یا خپل سیمه ایز اضطراري تاسیساتو ته زنګ ووهئ: آپریټر ته خبر ورکړئ چې تاسو د هغه چا لپاره پاملرنه کوئ چې څوک یې COVID-19 لري");


                }


            }else if (selectedItems.equals("Corona")){


                if(SelectedLang.equals("fa")) {

                    mQuestionsAdapter = new questionsAdapter(getCornoaItems(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\tبا شماره 166 تماس بگیرید یا با مرکز اضطراری محلی تماس بگیرید: به اپراتور اطلاع دهید که به دنبال مراقبت از شخصی هستید که مبتلا به ویروس کرونا است یا ممکن است به آن مبتلا باشد.");

                }else if(SelectedLang.equals("ps")){

                    mQuestionsAdapter = new questionsAdapter(getCornoaItemsPeshto(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\t6 166 ته زنګ ووهئ یا خپل سیمه ایز اضطراري تاسیساتو ته زنګ ووهئ: آپریټر ته خبر ورکړئ چې تاسو د هغه چا لپاره پاملرنه کوئ چې څوک یې COVID-19 لري");



                }


            }else if (selectedItems.equals("Sym")){


                if(SelectedLang.equals("fa")) {
                    mQuestionsAdapter = new questionsAdapter(getCornoaItems(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\tبا شماره 166 تماس بگیرید یا با مرکز اضطراری محلی تماس بگیرید: به اپراتور اطلاع دهید که به دنبال مراقبت از شخصی هستید که مبتلا به ویروس کرونا است یا ممکن است به آن مبتلا باشد.");

                }else if(SelectedLang.equals("ps")){

                    mQuestionsAdapter = new questionsAdapter(getCornoaItemsPeshto(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\t6 166 ته زنګ ووهئ یا خپل سیمه ایز اضطراري تاسیساتو ته زنګ ووهئ: آپریټر ته خبر ورکړئ چې تاسو د هغه چا لپاره پاملرنه کوئ چې څوک یې COVID-19 لري");


                }


            }else if (selectedItems.equals("Preventions")){


                if(SelectedLang.equals("fa")) {
                    mQuestionsAdapter = new questionsAdapter(getPreventionItems(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\tبا شماره 166 تماس بگیرید یا با مرکز اضطراری محلی تماس بگیرید: به اپراتور اطلاع دهید که به دنبال مراقبت از شخصی هستید که مبتلا به ویروس کرونا است یا ممکن است به آن مبتلا باشد.");

                }else if(SelectedLang.equals("ps")){


                    mQuestionsAdapter = new questionsAdapter(getPreventionItemsPeshto(), this);
                    recyclerView.setLayoutManager(new LinearLayoutManager(this));
                    //DividerItemDecoration DID = new DividerItemDecoration(getApplicationContext(), LinearLayoutManager.VERTICAL);
                    //DID.setDrawable(getApplicationContext().getResources().getDrawable(R.drawable.line_divider));
                    //recyclerView.addItemDecoration(DID);
                    recyclerView.setAdapter(mQuestionsAdapter);
                    txtHeading.setText("•\t6 166 ته زنګ ووهئ یا خپل سیمه ایز اضطراري تاسیساتو ته زنګ ووهئ: آپریټر ته خبر ورکړئ چې تاسو د هغه چا لپاره پاملرنه کوئ چې څوک یې COVID-19 لري");

                }


            }

        }
    }

    private ArrayList<mdlQuestions> getPreventionItems() {

        list = new ArrayList<>();

        for(int i=0; i<txtPrevQuesItems.length; i++){
            mdlQuestions m = new mdlQuestions();

            m.setTxtQuestions(txtPrevQuesItems[i]);
            m.setTxtAnswers(txtPrevAnsItems[i]);
            list.add(m);
        }
        return list;
    }

    private ArrayList<mdlQuestions> getPreventionItemsPeshto() {

        list = new ArrayList<>();

        for(int i=0; i<txtPrevQuesItems.length; i++){
            mdlQuestions m = new mdlQuestions();

            m.setTxtQuestions(txtPrevQuesItems[i]);
            m.setTxtAnswers(txtPrevAnsItems[i]);
            list.add(m);
        }
        return list;
    }

    private ArrayList<mdlQuestions> getCornoaItems() {

        list = new ArrayList<>();

        for(int i=0; i<txtCoronaQuesItems.length; i++){
            mdlQuestions m = new mdlQuestions();

            m.setTxtQuestions(txtCoronaQuesItems[i]);
            m.setTxtAnswers(txtCoronaAnsItems[i]);
            list.add(m);
        }
        return list;
    }

    private ArrayList<mdlQuestions> getCornoaItemsPeshto() {

        list = new ArrayList<>();

        for(int i=0; i<txtCoronaQuesItems.length; i++){
            mdlQuestions m = new mdlQuestions();

            m.setTxtQuestions(txtCoronaQuesItems[i]);
            m.setTxtAnswers(txtCoronaAnsItems[i]);
            list.add(m);
        }
        return list;
    }

    private ArrayList<mdlQuestions> getQuestionsAndAnswersItems() {


        list = new ArrayList<>();

        for(int i=0; i<txtQuesItems.length; i++){
            mdlQuestions m = new mdlQuestions();

            m.setTxtQuestions(txtQuesItems[i]);
            m.setTxtAnswers(txtAnsItems[i]);
            list.add(m);
        }
        return list;
    }


    private ArrayList<mdlQuestions> getQuestionsAndAnswersItemsPeshto() {


        list = new ArrayList<>();

        for(int i=0; i<txtQuesItems.length; i++){
            mdlQuestions m = new mdlQuestions();

            m.setTxtQuestions(txtQuesItems[i]);
            m.setTxtAnswers(txtAnsItems[i]);
            list.add(m);
        }
        return list;
    }

    @Override
    public void onClick(int position) {

    }
}
